# Install with: brew bundle

# Core tools
brew "git"
brew "vim"
brew "python@3.14"
brew "uv"            # Python package manager (used by manager-bot)
brew "git-crypt"     # encrypt secrets committed to git repos

# Shell
brew "starship"
brew "direnv"
brew "zsh-history-substring-search"

# Ruby
brew "chruby"
brew "ruby-install"

# Git
brew "git-delta"    # better git diff pager (used in gitconfig)
# git-smart: install separately with: gem install git-smart

# Search / navigation
brew "fzf"
brew "ripgrep"
brew "glow"         # markdown renderer (aliased as mdview, mdv)
brew "html2text"    # HTML to Markdown converter

# GitHub
brew "gh"

# Google Workspace (gws CLI — used by the google-workspace plugin & manager-bot)
brew "googleworkspace-cli"  # `gws`: Docs, Sheets, Drive, Calendar, Slides, Forms
brew "jq"                   # JSON parsing (gws skills pipe output through jq)

# Apps
cask "iterm2"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-source-code-pro"
cask "font-source-sans-3"

# JavaScript
brew "node"
